ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157axx_cm4.h
/***************  Bit definition for DDRCTRL_PCFGW_1 register  ****************/
#define DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_Pos     (0U)
#define DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_Msk     (0x3FFU << DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_Pos)   /*!< 0x000003FF */
#define DDRCTRL_PCFGW_1_WR_PORT_PRIORITY         DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_Msk               /*!< Determines the initial load value of write aging counters. These counters are parallel loaded after reset, or after each grant to the corresponding port. The aging counters down-count every clock cycle where the port is requesting but not granted. The higher significant 5-bits of the write aging counter sets the initial priority of the write channel of a given port. Port\qs priority increases as the higher significant 5-bits of the counter starts to decrease. When the aging counter becomes 0, the corresponding port channel has the highest priority level. */
#define DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_0       (0x1U << DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_Pos)     /*!< 0x00000001 */
#define DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_1       (0x2U << DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_Pos)     /*!< 0x00000002 */
#define DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_2       (0x4U << DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_Pos)     /*!< 0x00000004 */
#define DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_3       (0x8U << DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_Pos)     /*!< 0x00000008 */
#define DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_4       (0x10U << DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_Pos)    /*!< 0x00000010 */
#define DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_5       (0x20U << DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_Pos)    /*!< 0x00000020 */
#define DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_6       (0x40U << DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_Pos)    /*!< 0x00000040 */
#define DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_7       (0x80U << DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_Pos)    /*!< 0x00000080 */
#define DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_8       (0x100U << DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_Pos)   /*!< 0x00000100 */
#define DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_9       (0x200U << DDRCTRL_PCFGW_1_WR_PORT_PRIORITY_Pos)   /*!< 0x00000200 */
#define DDRCTRL_PCFGW_1_WR_PORT_AGING_EN_Pos     (12U)
#define DDRCTRL_PCFGW_1_WR_PORT_AGING_EN_Msk     (0x1U << DDRCTRL_PCFGW_1_WR_PORT_AGING_EN_Pos)     /*!< 0x00001000 */
#define DDRCTRL_PCFGW_1_WR_PORT_AGING_EN         DDRCTRL_PCFGW_1_WR_PORT_AGING_EN_Msk               /*!< If set to 1, enables aging function for the write channel of the port. */
#define DDRCTRL_PCFGW_1_WR_PORT_URGENT_EN_Pos    (13U)
#define DDRCTRL_PCFGW_1_WR_PORT_URGENT_EN_Msk    (0x1U << DDRCTRL_PCFGW_1_WR_PORT_URGENT_EN_Pos)    /*!< 0x00002000 */
#define DDRCTRL_PCFGW_1_WR_PORT_URGENT_EN        DDRCTRL_PCFGW_1_WR_PORT_URGENT_EN_Msk              /*!< If set to 1, enables the AXI urgent sideband signal (awurgent). When enabled and awurgent is asserted by the master, that port becomes the highest priority and co_gs_go2critical_wr signal to DDRC is asserted if enabled in PCCFG.go2critical_en register. */
#define DDRCTRL_PCFGW_1_WR_PORT_PAGEMATCH_EN_Pos (14U)
#define DDRCTRL_PCFGW_1_WR_PORT_PAGEMATCH_EN_Msk (0x1U << DDRCTRL_PCFGW_1_WR_PORT_PAGEMATCH_EN_Pos) /*!< 0x00004000 */
#define DDRCTRL_PCFGW_1_WR_PORT_PAGEMATCH_EN     DDRCTRL_PCFGW_1_WR_PORT_PAGEMATCH_EN_Msk           /*!< If set to 1, enables the Page Match feature. If enabled, once a requesting port is granted, the port is continued to be granted if the following immediate commands are to the same memory page (same bank and same row). See also related PCCFG.pagematch_limit register. */

/***************  Bit definition for DDRCTRL_PCTRL_1 register  ****************/
#define DDRCTRL_PCTRL_1_PORT_EN_Pos (0U)
#define DDRCTRL_PCTRL_1_PORT_EN_Msk (0x1U << DDRCTRL_PCTRL_1_PORT_EN_Pos) /*!< 0x00000001 */
#define DDRCTRL_PCTRL_1_PORT_EN     DDRCTRL_PCTRL_1_PORT_EN_Msk           /*!< Enables AXI port n. */

/**************  Bit definition for DDRCTRL_PCFGQOS0_1 register  **************/
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL1_Pos  (0U)
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL1_Msk  (0xFU << DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL1_Pos)  /*!< 0x0000000F */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL1      DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL1_Msk            /*!< Separation level1 indicating the end of region0 mapping; start of region0 is 0. Possible values for level1 are 0 to 13 (for dual RAQ) or 0 to 14 (for single RAQ) which corresponds to arqos. */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL1_0    (0x1U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL1_Pos)  /*!< 0x00000001 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL1_1    (0x2U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL1_Pos)  /*!< 0x00000002 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL1_2    (0x4U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL1_Pos)  /*!< 0x00000004 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL1_3    (0x8U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL1_Pos)  /*!< 0x00000008 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL2_Pos  (8U)
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL2_Msk  (0xFU << DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL2_Pos)  /*!< 0x00000F00 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL2      DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL2_Msk            /*!< Separation level2 indicating the end of region1 mapping; start of region1 is (level1 + 1). Possible values for level2 are (level1 + 1) to 14 which corresponds to arqos. */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL2_0    (0x1U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL2_Pos)  /*!< 0x00000100 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL2_1    (0x2U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL2_Pos)  /*!< 0x00000200 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL2_2    (0x4U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL2_Pos)  /*!< 0x00000400 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL2_3    (0x8U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_LEVEL2_Pos)  /*!< 0x00000800 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION0_Pos (16U)
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION0_Msk (0x3U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION0_Pos) /*!< 0x00030000 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION0     DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION0_Msk           /*!< This bitfield indicates the traffic class of region 0. */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION0_0   (0x1U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION0_Pos) /*!< 0x00010000 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION0_1   (0x2U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION0_Pos) /*!< 0x00020000 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION1_Pos (20U)
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION1_Msk (0x3U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION1_Pos) /*!< 0x00300000 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION1     DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION1_Msk           /*!< This bitfield indicates the traffic class of region 1. */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION1_0   (0x1U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION1_Pos) /*!< 0x00100000 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION1_1   (0x2U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION1_Pos) /*!< 0x00200000 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION2_Pos (24U)
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION2_Msk (0x3U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION2_Pos) /*!< 0x03000000 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION2     DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION2_Msk           /*!< This bitfield indicates the traffic class of region2. */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION2_0   (0x1U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION2_Pos) /*!< 0x01000000 */
#define DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION2_1   (0x2U << DDRCTRL_PCFGQOS0_1_RQOS_MAP_REGION2_Pos) /*!< 0x02000000 */

