ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157axx_cm4.h
/**************  Bit definition for RCC_MC_APB2ENCLRR register  ***************/
#define RCC_MC_APB2ENCLRR_TIM1EN_Pos              (0U)
#define RCC_MC_APB2ENCLRR_TIM1EN_Msk              (0x1U << RCC_MC_APB2ENCLRR_TIM1EN_Pos)             /*!< 0x00000001 */
#define RCC_MC_APB2ENCLRR_TIM1EN                  RCC_MC_APB2ENCLRR_TIM1EN_Msk                       /*!< TIM1 peripheral clocks enable */
#define RCC_MC_APB2ENCLRR_TIM8EN_Pos              (1U)
#define RCC_MC_APB2ENCLRR_TIM8EN_Msk              (0x1U << RCC_MC_APB2ENCLRR_TIM8EN_Pos)             /*!< 0x00000002 */
#define RCC_MC_APB2ENCLRR_TIM8EN                  RCC_MC_APB2ENCLRR_TIM8EN_Msk                       /*!< TIM8 peripheral clocks enable */
#define RCC_MC_APB2ENCLRR_TIM15EN_Pos             (2U)
#define RCC_MC_APB2ENCLRR_TIM15EN_Msk             (0x1U << RCC_MC_APB2ENCLRR_TIM15EN_Pos)            /*!< 0x00000004 */
#define RCC_MC_APB2ENCLRR_TIM15EN                 RCC_MC_APB2ENCLRR_TIM15EN_Msk                      /*!< TIM15 peripheral clocks enable */
#define RCC_MC_APB2ENCLRR_TIM16EN_Pos             (3U)
#define RCC_MC_APB2ENCLRR_TIM16EN_Msk             (0x1U << RCC_MC_APB2ENCLRR_TIM16EN_Pos)            /*!< 0x00000008 */
#define RCC_MC_APB2ENCLRR_TIM16EN                 RCC_MC_APB2ENCLRR_TIM16EN_Msk                      /*!< TIM16 peripheral clocks enable */
#define RCC_MC_APB2ENCLRR_TIM17EN_Pos             (4U)
#define RCC_MC_APB2ENCLRR_TIM17EN_Msk             (0x1U << RCC_MC_APB2ENCLRR_TIM17EN_Pos)            /*!< 0x00000010 */
#define RCC_MC_APB2ENCLRR_TIM17EN                 RCC_MC_APB2ENCLRR_TIM17EN_Msk                      /*!< TIM17 peripheral clocks enable */
#define RCC_MC_APB2ENCLRR_SPI1EN_Pos              (8U)
#define RCC_MC_APB2ENCLRR_SPI1EN_Msk              (0x1U << RCC_MC_APB2ENCLRR_SPI1EN_Pos)             /*!< 0x00000100 */
#define RCC_MC_APB2ENCLRR_SPI1EN                  RCC_MC_APB2ENCLRR_SPI1EN_Msk                       /*!< SPI/I2S1 peripheral clocks enable */
#define RCC_MC_APB2ENCLRR_SPI4EN_Pos              (9U)
#define RCC_MC_APB2ENCLRR_SPI4EN_Msk              (0x1U << RCC_MC_APB2ENCLRR_SPI4EN_Pos)             /*!< 0x00000200 */
#define RCC_MC_APB2ENCLRR_SPI4EN                  RCC_MC_APB2ENCLRR_SPI4EN_Msk                       /*!< SPI4 peripheral clocks enable */
#define RCC_MC_APB2ENCLRR_SPI5EN_Pos              (10U)
#define RCC_MC_APB2ENCLRR_SPI5EN_Msk              (0x1U << RCC_MC_APB2ENCLRR_SPI5EN_Pos)             /*!< 0x00000400 */
#define RCC_MC_APB2ENCLRR_SPI5EN                  RCC_MC_APB2ENCLRR_SPI5EN_Msk                       /*!< SPI5 peripheral clocks enable */
#define RCC_MC_APB2ENCLRR_USART6EN_Pos            (13U)
#define RCC_MC_APB2ENCLRR_USART6EN_Msk            (0x1U << RCC_MC_APB2ENCLRR_USART6EN_Pos)           /*!< 0x00002000 */
#define RCC_MC_APB2ENCLRR_USART6EN                RCC_MC_APB2ENCLRR_USART6EN_Msk                     /*!< USART6 peripheral clocks enable */
#define RCC_MC_APB2ENCLRR_SAI1EN_Pos              (16U)
#define RCC_MC_APB2ENCLRR_SAI1EN_Msk              (0x1U << RCC_MC_APB2ENCLRR_SAI1EN_Pos)             /*!< 0x00010000 */
#define RCC_MC_APB2ENCLRR_SAI1EN                  RCC_MC_APB2ENCLRR_SAI1EN_Msk                       /*!< SAI1 peripheral clocks enable */
#define RCC_MC_APB2ENCLRR_SAI2EN_Pos              (17U)
#define RCC_MC_APB2ENCLRR_SAI2EN_Msk              (0x1U << RCC_MC_APB2ENCLRR_SAI2EN_Pos)             /*!< 0x00020000 */
#define RCC_MC_APB2ENCLRR_SAI2EN                  RCC_MC_APB2ENCLRR_SAI2EN_Msk                       /*!< SAI2 peripheral clocks enable */
#define RCC_MC_APB2ENCLRR_SAI3EN_Pos              (18U)
#define RCC_MC_APB2ENCLRR_SAI3EN_Msk              (0x1U << RCC_MC_APB2ENCLRR_SAI3EN_Pos)             /*!< 0x00040000 */
#define RCC_MC_APB2ENCLRR_SAI3EN                  RCC_MC_APB2ENCLRR_SAI3EN_Msk                       /*!< SAI3 peripheral clocks enable */
#define RCC_MC_APB2ENCLRR_DFSDMEN_Pos             (20U)
#define RCC_MC_APB2ENCLRR_DFSDMEN_Msk             (0x1U << RCC_MC_APB2ENCLRR_DFSDMEN_Pos)            /*!< 0x00100000 */
#define RCC_MC_APB2ENCLRR_DFSDMEN                 RCC_MC_APB2ENCLRR_DFSDMEN_Msk                      /*!< DFSDM peripheral clocks enable */
#define RCC_MC_APB2ENCLRR_ADFSDMEN_Pos            (21U)
#define RCC_MC_APB2ENCLRR_ADFSDMEN_Msk            (0x1U << RCC_MC_APB2ENCLRR_ADFSDMEN_Pos)           /*!< 0x00200000 */
#define RCC_MC_APB2ENCLRR_ADFSDMEN                RCC_MC_APB2ENCLRR_ADFSDMEN_Msk                     /*!< Audio DFSDM peripheral clocks enable */
#define RCC_MC_APB2ENCLRR_FDCANEN_Pos             (24U)
#define RCC_MC_APB2ENCLRR_FDCANEN_Msk             (0x1U << RCC_MC_APB2ENCLRR_FDCANEN_Pos)            /*!< 0x01000000 */
#define RCC_MC_APB2ENCLRR_FDCANEN                 RCC_MC_APB2ENCLRR_FDCANEN_Msk                      /*!< FDCAN and CANRAM peripheral clocks enable */

/**************  Bit definition for RCC_MC_APB3ENSETR register  ***************/
#define RCC_MC_APB3ENSETR_LPTIM2EN_Pos            (0U)
#define RCC_MC_APB3ENSETR_LPTIM2EN_Msk            (0x1U << RCC_MC_APB3ENSETR_LPTIM2EN_Pos)           /*!< 0x00000001 */
#define RCC_MC_APB3ENSETR_LPTIM2EN                RCC_MC_APB3ENSETR_LPTIM2EN_Msk                     /*!< LPTIM2 peripheral clocks enable */
#define RCC_MC_APB3ENSETR_LPTIM3EN_Pos            (1U)
#define RCC_MC_APB3ENSETR_LPTIM3EN_Msk            (0x1U << RCC_MC_APB3ENSETR_LPTIM3EN_Pos)           /*!< 0x00000002 */
#define RCC_MC_APB3ENSETR_LPTIM3EN                RCC_MC_APB3ENSETR_LPTIM3EN_Msk                     /*!< LPTIM3 peripheral clocks enable */
#define RCC_MC_APB3ENSETR_LPTIM4EN_Pos            (2U)
#define RCC_MC_APB3ENSETR_LPTIM4EN_Msk            (0x1U << RCC_MC_APB3ENSETR_LPTIM4EN_Pos)           /*!< 0x00000004 */
#define RCC_MC_APB3ENSETR_LPTIM4EN                RCC_MC_APB3ENSETR_LPTIM4EN_Msk                     /*!< LPTIM4 peripheral clocks enable */
#define RCC_MC_APB3ENSETR_LPTIM5EN_Pos            (3U)
#define RCC_MC_APB3ENSETR_LPTIM5EN_Msk            (0x1U << RCC_MC_APB3ENSETR_LPTIM5EN_Pos)           /*!< 0x00000008 */
#define RCC_MC_APB3ENSETR_LPTIM5EN                RCC_MC_APB3ENSETR_LPTIM5EN_Msk                     /*!< LPTIM5 peripheral clocks enable */
#define RCC_MC_APB3ENSETR_SAI4EN_Pos              (8U)
#define RCC_MC_APB3ENSETR_SAI4EN_Msk              (0x1U << RCC_MC_APB3ENSETR_SAI4EN_Pos)             /*!< 0x00000100 */
#define RCC_MC_APB3ENSETR_SAI4EN                  RCC_MC_APB3ENSETR_SAI4EN_Msk                       /*!< SAI4 peripheral clocks enable */
#define RCC_MC_APB3ENSETR_SYSCFGEN_Pos            (11U)
#define RCC_MC_APB3ENSETR_SYSCFGEN_Msk            (0x1U << RCC_MC_APB3ENSETR_SYSCFGEN_Pos)           /*!< 0x00000800 */
#define RCC_MC_APB3ENSETR_SYSCFGEN                RCC_MC_APB3ENSETR_SYSCFGEN_Msk                     /*!< SYSCFG peripheral clocks enable */
#define RCC_MC_APB3ENSETR_VREFEN_Pos              (13U)
#define RCC_MC_APB3ENSETR_VREFEN_Msk              (0x1U << RCC_MC_APB3ENSETR_VREFEN_Pos)             /*!< 0x00002000 */
#define RCC_MC_APB3ENSETR_VREFEN                  RCC_MC_APB3ENSETR_VREFEN_Msk                       /*!< VREF peripheral clocks enable */
#define RCC_MC_APB3ENSETR_DTSEN_Pos               (16U)
#define RCC_MC_APB3ENSETR_DTSEN_Msk               (0x1U << RCC_MC_APB3ENSETR_DTSEN_Pos)              /*!< 0x00010000 */
#define RCC_MC_APB3ENSETR_DTSEN                   RCC_MC_APB3ENSETR_DTSEN_Msk                        /*!< DTS peripheral clocks enable */
#define RCC_MC_APB3ENSETR_HDPEN_Pos               (20U)
#define RCC_MC_APB3ENSETR_HDPEN_Msk               (0x1U << RCC_MC_APB3ENSETR_HDPEN_Pos)              /*!< 0x00100000 */
#define RCC_MC_APB3ENSETR_HDPEN                   RCC_MC_APB3ENSETR_HDPEN_Msk                        /*!< HDP peripheral clocks enable */

/**************  Bit definition for RCC_MC_APB3ENCLRR register  ***************/
#define RCC_MC_APB3ENCLRR_LPTIM2EN_Pos            (0U)
#define RCC_MC_APB3ENCLRR_LPTIM2EN_Msk            (0x1U << RCC_MC_APB3ENCLRR_LPTIM2EN_Pos)           /*!< 0x00000001 */
#define RCC_MC_APB3ENCLRR_LPTIM2EN                RCC_MC_APB3ENCLRR_LPTIM2EN_Msk                     /*!< LPTIM2 peripheral clocks enable */
#define RCC_MC_APB3ENCLRR_LPTIM3EN_Pos            (1U)
#define RCC_MC_APB3ENCLRR_LPTIM3EN_Msk            (0x1U << RCC_MC_APB3ENCLRR_LPTIM3EN_Pos)           /*!< 0x00000002 */
#define RCC_MC_APB3ENCLRR_LPTIM3EN                RCC_MC_APB3ENCLRR_LPTIM3EN_Msk                     /*!< LPTIM3 peripheral clocks enable */
#define RCC_MC_APB3ENCLRR_LPTIM4EN_Pos            (2U)
#define RCC_MC_APB3ENCLRR_LPTIM4EN_Msk            (0x1U << RCC_MC_APB3ENCLRR_LPTIM4EN_Pos)           /*!< 0x00000004 */
#define RCC_MC_APB3ENCLRR_LPTIM4EN                RCC_MC_APB3ENCLRR_LPTIM4EN_Msk                     /*!< LPTIM4 peripheral clocks enable */
#define RCC_MC_APB3ENCLRR_LPTIM5EN_Pos            (3U)
#define RCC_MC_APB3ENCLRR_LPTIM5EN_Msk            (0x1U << RCC_MC_APB3ENCLRR_LPTIM5EN_Pos)           /*!< 0x00000008 */
#define RCC_MC_APB3ENCLRR_LPTIM5EN                RCC_MC_APB3ENCLRR_LPTIM5EN_Msk                     /*!< LPTIM5 peripheral clocks enable */
#define RCC_MC_APB3ENCLRR_SAI4EN_Pos              (8U)
#define RCC_MC_APB3ENCLRR_SAI4EN_Msk              (0x1U << RCC_MC_APB3ENCLRR_SAI4EN_Pos)             /*!< 0x00000100 */
#define RCC_MC_APB3ENCLRR_SAI4EN                  RCC_MC_APB3ENCLRR_SAI4EN_Msk                       /*!< SAI4 peripheral clocks enable */
#define RCC_MC_APB3ENCLRR_SYSCFGEN_Pos            (11U)
#define RCC_MC_APB3ENCLRR_SYSCFGEN_Msk            (0x1U << RCC_MC_APB3ENCLRR_SYSCFGEN_Pos)           /*!< 0x00000800 */
#define RCC_MC_APB3ENCLRR_SYSCFGEN                RCC_MC_APB3ENCLRR_SYSCFGEN_Msk                     /*!< SYSCFG peripheral clocks enable */
#define RCC_MC_APB3ENCLRR_VREFEN_Pos              (13U)
#define RCC_MC_APB3ENCLRR_VREFEN_Msk              (0x1U << RCC_MC_APB3ENCLRR_VREFEN_Pos)             /*!< 0x00002000 */
#define RCC_MC_APB3ENCLRR_VREFEN                  RCC_MC_APB3ENCLRR_VREFEN_Msk                       /*!< VREF peripheral clocks enable */
#define RCC_MC_APB3ENCLRR_DTSEN_Pos               (16U)
#define RCC_MC_APB3ENCLRR_DTSEN_Msk               (0x1U << RCC_MC_APB3ENCLRR_DTSEN_Pos)              /*!< 0x00010000 */
#define RCC_MC_APB3ENCLRR_DTSEN                   RCC_MC_APB3ENCLRR_DTSEN_Msk                        /*!< DTS peripheral clocks enable */
#define RCC_MC_APB3ENCLRR_HDPEN_Pos               (20U)
#define RCC_MC_APB3ENCLRR_HDPEN_Msk               (0x1U << RCC_MC_APB3ENCLRR_HDPEN_Pos)              /*!< 0x00100000 */
#define RCC_MC_APB3ENCLRR_HDPEN                   RCC_MC_APB3ENCLRR_HDPEN_Msk                        /*!< HDP peripheral clocks enable */

/**************  Bit definition for RCC_MC_AHB2ENSETR register  ***************/
#define RCC_MC_AHB2ENSETR_DMA1EN_Pos              (0U)
#define RCC_MC_AHB2ENSETR_DMA1EN_Msk              (0x1U << RCC_MC_AHB2ENSETR_DMA1EN_Pos)             /*!< 0x00000001 */
#define RCC_MC_AHB2ENSETR_DMA1EN                  RCC_MC_AHB2ENSETR_DMA1EN_Msk                       /*!< DMA1 peripheral clocks enable */
#define RCC_MC_AHB2ENSETR_DMA2EN_Pos              (1U)
#define RCC_MC_AHB2ENSETR_DMA2EN_Msk              (0x1U << RCC_MC_AHB2ENSETR_DMA2EN_Pos)             /*!< 0x00000002 */
#define RCC_MC_AHB2ENSETR_DMA2EN                  RCC_MC_AHB2ENSETR_DMA2EN_Msk                       /*!< DMA2 peripheral clocks enable */
#define RCC_MC_AHB2ENSETR_DMAMUXEN_Pos            (2U)
#define RCC_MC_AHB2ENSETR_DMAMUXEN_Msk            (0x1U << RCC_MC_AHB2ENSETR_DMAMUXEN_Pos)           /*!< 0x00000004 */
#define RCC_MC_AHB2ENSETR_DMAMUXEN                RCC_MC_AHB2ENSETR_DMAMUXEN_Msk                     /*!< DMAMUX peripheral clocks enable */
#define RCC_MC_AHB2ENSETR_ADC12EN_Pos             (5U)
#define RCC_MC_AHB2ENSETR_ADC12EN_Msk             (0x1U << RCC_MC_AHB2ENSETR_ADC12EN_Pos)            /*!< 0x00000020 */
#define RCC_MC_AHB2ENSETR_ADC12EN                 RCC_MC_AHB2ENSETR_ADC12EN_Msk                      /*!< ADC1&amp;2 peripheral clocks enable */
#define RCC_MC_AHB2ENSETR_USBOEN_Pos              (8U)
#define RCC_MC_AHB2ENSETR_USBOEN_Msk              (0x1U << RCC_MC_AHB2ENSETR_USBOEN_Pos)             /*!< 0x00000100 */
#define RCC_MC_AHB2ENSETR_USBOEN                  RCC_MC_AHB2ENSETR_USBOEN_Msk                       /*!< USBO peripheral clocks enable */
#define RCC_MC_AHB2ENSETR_SDMMC3EN_Pos            (16U)
#define RCC_MC_AHB2ENSETR_SDMMC3EN_Msk            (0x1U << RCC_MC_AHB2ENSETR_SDMMC3EN_Pos)           /*!< 0x00010000 */
#define RCC_MC_AHB2ENSETR_SDMMC3EN                RCC_MC_AHB2ENSETR_SDMMC3EN_Msk                     /*!< SDMMC3 and SDMMC3 delay (DLYBSD3) block peripheral clocks enable */

/**************  Bit definition for RCC_MC_AHB2ENCLRR register  ***************/
#define RCC_MC_AHB2ENCLRR_DMA1EN_Pos              (0U)
#define RCC_MC_AHB2ENCLRR_DMA1EN_Msk              (0x1U << RCC_MC_AHB2ENCLRR_DMA1EN_Pos)             /*!< 0x00000001 */
#define RCC_MC_AHB2ENCLRR_DMA1EN                  RCC_MC_AHB2ENCLRR_DMA1EN_Msk                       /*!< DMA1 peripheral clocks enable */
#define RCC_MC_AHB2ENCLRR_DMA2EN_Pos              (1U)
#define RCC_MC_AHB2ENCLRR_DMA2EN_Msk              (0x1U << RCC_MC_AHB2ENCLRR_DMA2EN_Pos)             /*!< 0x00000002 */
#define RCC_MC_AHB2ENCLRR_DMA2EN                  RCC_MC_AHB2ENCLRR_DMA2EN_Msk                       /*!< DMA2 peripheral clocks enable */
#define RCC_MC_AHB2ENCLRR_DMAMUXEN_Pos            (2U)
#define RCC_MC_AHB2ENCLRR_DMAMUXEN_Msk            (0x1U << RCC_MC_AHB2ENCLRR_DMAMUXEN_Pos)           /*!< 0x00000004 */
#define RCC_MC_AHB2ENCLRR_DMAMUXEN                RCC_MC_AHB2ENCLRR_DMAMUXEN_Msk                     /*!< DMAMUX peripheral clocks enable */
#define RCC_MC_AHB2ENCLRR_ADC12EN_Pos             (5U)
#define RCC_MC_AHB2ENCLRR_ADC12EN_Msk             (0x1U << RCC_MC_AHB2ENCLRR_ADC12EN_Pos)            /*!< 0x00000020 */
#define RCC_MC_AHB2ENCLRR_ADC12EN                 RCC_MC_AHB2ENCLRR_ADC12EN_Msk                      /*!< ADC1&amp;2 peripheral clocks enable */
#define RCC_MC_AHB2ENCLRR_USBOEN_Pos              (8U)
#define RCC_MC_AHB2ENCLRR_USBOEN_Msk              (0x1U << RCC_MC_AHB2ENCLRR_USBOEN_Pos)             /*!< 0x00000100 */
#define RCC_MC_AHB2ENCLRR_USBOEN                  RCC_MC_AHB2ENCLRR_USBOEN_Msk                       /*!< USBO peripheral clocks enable */
#define RCC_MC_AHB2ENCLRR_SDMMC3EN_Pos            (16U)
#define RCC_MC_AHB2ENCLRR_SDMMC3EN_Msk            (0x1U << RCC_MC_AHB2ENCLRR_SDMMC3EN_Pos)           /*!< 0x00010000 */
#define RCC_MC_AHB2ENCLRR_SDMMC3EN                RCC_MC_AHB2ENCLRR_SDMMC3EN_Msk                     /*!< SDMMC3 and SDMMC3 delay (DLYBSD3) block peripheral clocks enable */

/**************  Bit definition for RCC_MC_AHB3ENSETR register  ***************/
#define RCC_MC_AHB3ENSETR_DCMIEN_Pos              (0U)
#define RCC_MC_AHB3ENSETR_DCMIEN_Msk              (0x1U << RCC_MC_AHB3ENSETR_DCMIEN_Pos)             /*!< 0x00000001 */
#define RCC_MC_AHB3ENSETR_DCMIEN                  RCC_MC_AHB3ENSETR_DCMIEN_Msk                       /*!< DCMI peripheral clocks enable */
#define RCC_MC_AHB3ENSETR_CRYP2EN_Pos             (4U)
#define RCC_MC_AHB3ENSETR_CRYP2EN_Msk             (0x1U << RCC_MC_AHB3ENSETR_CRYP2EN_Pos)            /*!< 0x00000010 */
#define RCC_MC_AHB3ENSETR_CRYP2EN                 RCC_MC_AHB3ENSETR_CRYP2EN_Msk                      /*!< CRYP2 (3DES/AES2) peripheral clocks enable */
#define RCC_MC_AHB3ENSETR_HASH2EN_Pos             (5U)
#define RCC_MC_AHB3ENSETR_HASH2EN_Msk             (0x1U << RCC_MC_AHB3ENSETR_HASH2EN_Pos)            /*!< 0x00000020 */
#define RCC_MC_AHB3ENSETR_HASH2EN                 RCC_MC_AHB3ENSETR_HASH2EN_Msk                      /*!< HASH2 peripheral clocks enable */
#define RCC_MC_AHB3ENSETR_RNG2EN_Pos              (6U)
#define RCC_MC_AHB3ENSETR_RNG2EN_Msk              (0x1U << RCC_MC_AHB3ENSETR_RNG2EN_Pos)             /*!< 0x00000040 */
#define RCC_MC_AHB3ENSETR_RNG2EN                  RCC_MC_AHB3ENSETR_RNG2EN_Msk                       /*!< RNG2 peripheral clocks enable */
#define RCC_MC_AHB3ENSETR_CRC2EN_Pos              (7U)
#define RCC_MC_AHB3ENSETR_CRC2EN_Msk              (0x1U << RCC_MC_AHB3ENSETR_CRC2EN_Pos)             /*!< 0x00000080 */
#define RCC_MC_AHB3ENSETR_CRC2EN                  RCC_MC_AHB3ENSETR_CRC2EN_Msk                       /*!< CRC2 peripheral clocks enable */
#define RCC_MC_AHB3ENSETR_HSEMEN_Pos              (11U)
#define RCC_MC_AHB3ENSETR_HSEMEN_Msk              (0x1U << RCC_MC_AHB3ENSETR_HSEMEN_Pos)             /*!< 0x00000800 */
#define RCC_MC_AHB3ENSETR_HSEMEN                  RCC_MC_AHB3ENSETR_HSEMEN_Msk                       /*!< HSEM peripheral clocks enable */
#define RCC_MC_AHB3ENSETR_IPCCEN_Pos              (12U)
#define RCC_MC_AHB3ENSETR_IPCCEN_Msk              (0x1U << RCC_MC_AHB3ENSETR_IPCCEN_Pos)             /*!< 0x00001000 */
#define RCC_MC_AHB3ENSETR_IPCCEN                  RCC_MC_AHB3ENSETR_IPCCEN_Msk                       /*!< IPCC peripheral clocks enable */

/**************  Bit definition for RCC_MC_AHB3ENCLRR register  ***************/
#define RCC_MC_AHB3ENCLRR_DCMIEN_Pos              (0U)
#define RCC_MC_AHB3ENCLRR_DCMIEN_Msk              (0x1U << RCC_MC_AHB3ENCLRR_DCMIEN_Pos)             /*!< 0x00000001 */
#define RCC_MC_AHB3ENCLRR_DCMIEN                  RCC_MC_AHB3ENCLRR_DCMIEN_Msk                       /*!< DCMI peripheral clocks enable */
#define RCC_MC_AHB3ENCLRR_CRYP2EN_Pos             (4U)
#define RCC_MC_AHB3ENCLRR_CRYP2EN_Msk             (0x1U << RCC_MC_AHB3ENCLRR_CRYP2EN_Pos)            /*!< 0x00000010 */
#define RCC_MC_AHB3ENCLRR_CRYP2EN                 RCC_MC_AHB3ENCLRR_CRYP2EN_Msk                      /*!< CRYP2 (3DES/AES2) peripheral clocks enable */
#define RCC_MC_AHB3ENCLRR_HASH2EN_Pos             (5U)
#define RCC_MC_AHB3ENCLRR_HASH2EN_Msk             (0x1U << RCC_MC_AHB3ENCLRR_HASH2EN_Pos)            /*!< 0x00000020 */
#define RCC_MC_AHB3ENCLRR_HASH2EN                 RCC_MC_AHB3ENCLRR_HASH2EN_Msk                      /*!< HASH2 peripheral clocks enable */
#define RCC_MC_AHB3ENCLRR_RNG2EN_Pos              (6U)
#define RCC_MC_AHB3ENCLRR_RNG2EN_Msk              (0x1U << RCC_MC_AHB3ENCLRR_RNG2EN_Pos)             /*!< 0x00000040 */
#define RCC_MC_AHB3ENCLRR_RNG2EN                  RCC_MC_AHB3ENCLRR_RNG2EN_Msk                       /*!< RNG2 peripheral clocks enable */
#define RCC_MC_AHB3ENCLRR_CRC2EN_Pos              (7U)
#define RCC_MC_AHB3ENCLRR_CRC2EN_Msk              (0x1U << RCC_MC_AHB3ENCLRR_CRC2EN_Pos)             /*!< 0x00000080 */
#define RCC_MC_AHB3ENCLRR_CRC2EN                  RCC_MC_AHB3ENCLRR_CRC2EN_Msk                       /*!< CRC2 peripheral clocks enable */
#define RCC_MC_AHB3ENCLRR_HSEMEN_Pos              (11U)
#define RCC_MC_AHB3ENCLRR_HSEMEN_Msk              (0x1U << RCC_MC_AHB3ENCLRR_HSEMEN_Pos)             /*!< 0x00000800 */
#define RCC_MC_AHB3ENCLRR_HSEMEN                  RCC_MC_AHB3ENCLRR_HSEMEN_Msk                       /*!< HSEM peripheral clocks enable */
#define RCC_MC_AHB3ENCLRR_IPCCEN_Pos              (12U)
#define RCC_MC_AHB3ENCLRR_IPCCEN_Msk              (0x1U << RCC_MC_AHB3ENCLRR_IPCCEN_Pos)             /*!< 0x00001000 */
#define RCC_MC_AHB3ENCLRR_IPCCEN                  RCC_MC_AHB3ENCLRR_IPCCEN_Msk                       /*!< IPCC peripheral clocks enable */

/**************  Bit definition for RCC_MC_AHB4ENSETR register  ***************/
#define RCC_MC_AHB4ENSETR_GPIOAEN_Pos             (0U)
#define RCC_MC_AHB4ENSETR_GPIOAEN_Msk             (0x1U << RCC_MC_AHB4ENSETR_GPIOAEN_Pos)            /*!< 0x00000001 */
#define RCC_MC_AHB4ENSETR_GPIOAEN                 RCC_MC_AHB4ENSETR_GPIOAEN_Msk                      /*!< GPIOA peripheral clocks enable */
#define RCC_MC_AHB4ENSETR_GPIOBEN_Pos             (1U)
#define RCC_MC_AHB4ENSETR_GPIOBEN_Msk             (0x1U << RCC_MC_AHB4ENSETR_GPIOBEN_Pos)            /*!< 0x00000002 */
#define RCC_MC_AHB4ENSETR_GPIOBEN                 RCC_MC_AHB4ENSETR_GPIOBEN_Msk                      /*!< GPIOB peripheral clocks enable */
#define RCC_MC_AHB4ENSETR_GPIOCEN_Pos             (2U)
#define RCC_MC_AHB4ENSETR_GPIOCEN_Msk             (0x1U << RCC_MC_AHB4ENSETR_GPIOCEN_Pos)            /*!< 0x00000004 */
#define RCC_MC_AHB4ENSETR_GPIOCEN                 RCC_MC_AHB4ENSETR_GPIOCEN_Msk                      /*!< GPIOC peripheral clocks enable */
#define RCC_MC_AHB4ENSETR_GPIODEN_Pos             (3U)
#define RCC_MC_AHB4ENSETR_GPIODEN_Msk             (0x1U << RCC_MC_AHB4ENSETR_GPIODEN_Pos)            /*!< 0x00000008 */
#define RCC_MC_AHB4ENSETR_GPIODEN                 RCC_MC_AHB4ENSETR_GPIODEN_Msk                      /*!< GPIOD peripheral clocks enable */
#define RCC_MC_AHB4ENSETR_GPIOEEN_Pos             (4U)
#define RCC_MC_AHB4ENSETR_GPIOEEN_Msk             (0x1U << RCC_MC_AHB4ENSETR_GPIOEEN_Pos)            /*!< 0x00000010 */
#define RCC_MC_AHB4ENSETR_GPIOEEN                 RCC_MC_AHB4ENSETR_GPIOEEN_Msk                      /*!< GPIOE peripheral clocks enable */
#define RCC_MC_AHB4ENSETR_GPIOFEN_Pos             (5U)
#define RCC_MC_AHB4ENSETR_GPIOFEN_Msk             (0x1U << RCC_MC_AHB4ENSETR_GPIOFEN_Pos)            /*!< 0x00000020 */
#define RCC_MC_AHB4ENSETR_GPIOFEN                 RCC_MC_AHB4ENSETR_GPIOFEN_Msk                      /*!< GPIOF peripheral clocks enable */
#define RCC_MC_AHB4ENSETR_GPIOGEN_Pos             (6U)
#define RCC_MC_AHB4ENSETR_GPIOGEN_Msk             (0x1U << RCC_MC_AHB4ENSETR_GPIOGEN_Pos)            /*!< 0x00000040 */
#define RCC_MC_AHB4ENSETR_GPIOGEN                 RCC_MC_AHB4ENSETR_GPIOGEN_Msk                      /*!< GPIOG peripheral clocks enable */
#define RCC_MC_AHB4ENSETR_GPIOHEN_Pos             (7U)
#define RCC_MC_AHB4ENSETR_GPIOHEN_Msk             (0x1U << RCC_MC_AHB4ENSETR_GPIOHEN_Pos)            /*!< 0x00000080 */
#define RCC_MC_AHB4ENSETR_GPIOHEN                 RCC_MC_AHB4ENSETR_GPIOHEN_Msk                      /*!< GPIOH peripheral clocks enable */
#define RCC_MC_AHB4ENSETR_GPIOIEN_Pos             (8U)
#define RCC_MC_AHB4ENSETR_GPIOIEN_Msk             (0x1U << RCC_MC_AHB4ENSETR_GPIOIEN_Pos)            /*!< 0x00000100 */
#define RCC_MC_AHB4ENSETR_GPIOIEN                 RCC_MC_AHB4ENSETR_GPIOIEN_Msk                      /*!< GPIOI peripheral clocks enable */
#define RCC_MC_AHB4ENSETR_GPIOJEN_Pos             (9U)
#define RCC_MC_AHB4ENSETR_GPIOJEN_Msk             (0x1U << RCC_MC_AHB4ENSETR_GPIOJEN_Pos)            /*!< 0x00000200 */
#define RCC_MC_AHB4ENSETR_GPIOJEN                 RCC_MC_AHB4ENSETR_GPIOJEN_Msk                      /*!< GPIOJ peripheral clocks enable */
#define RCC_MC_AHB4ENSETR_GPIOKEN_Pos             (10U)
#define RCC_MC_AHB4ENSETR_GPIOKEN_Msk             (0x1U << RCC_MC_AHB4ENSETR_GPIOKEN_Pos)            /*!< 0x00000400 */
#define RCC_MC_AHB4ENSETR_GPIOKEN                 RCC_MC_AHB4ENSETR_GPIOKEN_Msk                      /*!< GPIOK peripheral clocks enable */

