ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp157axx_cm4.h
/*************  Bit definition for RCC_MP_APB3LPENCLRR register  **************/
#define RCC_MP_APB3LPENCLRR_LPTIM2LPEN_Pos        (0U)
#define RCC_MP_APB3LPENCLRR_LPTIM2LPEN_Msk        (0x1U << RCC_MP_APB3LPENCLRR_LPTIM2LPEN_Pos)       /*!< 0x00000001 */
#define RCC_MP_APB3LPENCLRR_LPTIM2LPEN            RCC_MP_APB3LPENCLRR_LPTIM2LPEN_Msk                 /*!< LPTIM2 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB3LPENCLRR_LPTIM3LPEN_Pos        (1U)
#define RCC_MP_APB3LPENCLRR_LPTIM3LPEN_Msk        (0x1U << RCC_MP_APB3LPENCLRR_LPTIM3LPEN_Pos)       /*!< 0x00000002 */
#define RCC_MP_APB3LPENCLRR_LPTIM3LPEN            RCC_MP_APB3LPENCLRR_LPTIM3LPEN_Msk                 /*!< LPTIM3 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB3LPENCLRR_LPTIM4LPEN_Pos        (2U)
#define RCC_MP_APB3LPENCLRR_LPTIM4LPEN_Msk        (0x1U << RCC_MP_APB3LPENCLRR_LPTIM4LPEN_Pos)       /*!< 0x00000004 */
#define RCC_MP_APB3LPENCLRR_LPTIM4LPEN            RCC_MP_APB3LPENCLRR_LPTIM4LPEN_Msk                 /*!< LPTIM4 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB3LPENCLRR_LPTIM5LPEN_Pos        (3U)
#define RCC_MP_APB3LPENCLRR_LPTIM5LPEN_Msk        (0x1U << RCC_MP_APB3LPENCLRR_LPTIM5LPEN_Pos)       /*!< 0x00000008 */
#define RCC_MP_APB3LPENCLRR_LPTIM5LPEN            RCC_MP_APB3LPENCLRR_LPTIM5LPEN_Msk                 /*!< LPTIM5 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB3LPENCLRR_SAI4LPEN_Pos          (8U)
#define RCC_MP_APB3LPENCLRR_SAI4LPEN_Msk          (0x1U << RCC_MP_APB3LPENCLRR_SAI4LPEN_Pos)         /*!< 0x00000100 */
#define RCC_MP_APB3LPENCLRR_SAI4LPEN              RCC_MP_APB3LPENCLRR_SAI4LPEN_Msk                   /*!< SAI4 peripheral clocks enable during CSleep mode */
#define RCC_MP_APB3LPENCLRR_SYSCFGLPEN_Pos        (11U)
#define RCC_MP_APB3LPENCLRR_SYSCFGLPEN_Msk        (0x1U << RCC_MP_APB3LPENCLRR_SYSCFGLPEN_Pos)       /*!< 0x00000800 */
#define RCC_MP_APB3LPENCLRR_SYSCFGLPEN            RCC_MP_APB3LPENCLRR_SYSCFGLPEN_Msk                 /*!< SYSCFG peripheral clocks enable during CSleep mode */
#define RCC_MP_APB3LPENCLRR_VREFLPEN_Pos          (13U)
#define RCC_MP_APB3LPENCLRR_VREFLPEN_Msk          (0x1U << RCC_MP_APB3LPENCLRR_VREFLPEN_Pos)         /*!< 0x00002000 */
#define RCC_MP_APB3LPENCLRR_VREFLPEN              RCC_MP_APB3LPENCLRR_VREFLPEN_Msk                   /*!< VREF peripheral clocks enable during CSleep mode */
#define RCC_MP_APB3LPENCLRR_DTSLPEN_Pos           (16U)
#define RCC_MP_APB3LPENCLRR_DTSLPEN_Msk           (0x1U << RCC_MP_APB3LPENCLRR_DTSLPEN_Pos)          /*!< 0x00010000 */
#define RCC_MP_APB3LPENCLRR_DTSLPEN               RCC_MP_APB3LPENCLRR_DTSLPEN_Msk                    /*!< DTS peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MP_AHB2LPENSETR register  **************/
#define RCC_MP_AHB2LPENSETR_DMA1LPEN_Pos          (0U)
#define RCC_MP_AHB2LPENSETR_DMA1LPEN_Msk          (0x1U << RCC_MP_AHB2LPENSETR_DMA1LPEN_Pos)         /*!< 0x00000001 */
#define RCC_MP_AHB2LPENSETR_DMA1LPEN              RCC_MP_AHB2LPENSETR_DMA1LPEN_Msk                   /*!< DMA1 peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB2LPENSETR_DMA2LPEN_Pos          (1U)
#define RCC_MP_AHB2LPENSETR_DMA2LPEN_Msk          (0x1U << RCC_MP_AHB2LPENSETR_DMA2LPEN_Pos)         /*!< 0x00000002 */
#define RCC_MP_AHB2LPENSETR_DMA2LPEN              RCC_MP_AHB2LPENSETR_DMA2LPEN_Msk                   /*!< DMA2 peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB2LPENSETR_DMAMUXLPEN_Pos        (2U)
#define RCC_MP_AHB2LPENSETR_DMAMUXLPEN_Msk        (0x1U << RCC_MP_AHB2LPENSETR_DMAMUXLPEN_Pos)       /*!< 0x00000004 */
#define RCC_MP_AHB2LPENSETR_DMAMUXLPEN            RCC_MP_AHB2LPENSETR_DMAMUXLPEN_Msk                 /*!< DMAMUX peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB2LPENSETR_ADC12LPEN_Pos         (5U)
#define RCC_MP_AHB2LPENSETR_ADC12LPEN_Msk         (0x1U << RCC_MP_AHB2LPENSETR_ADC12LPEN_Pos)        /*!< 0x00000020 */
#define RCC_MP_AHB2LPENSETR_ADC12LPEN             RCC_MP_AHB2LPENSETR_ADC12LPEN_Msk                  /*!< ADC1&amp;2 peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB2LPENSETR_USBOLPEN_Pos          (8U)
#define RCC_MP_AHB2LPENSETR_USBOLPEN_Msk          (0x1U << RCC_MP_AHB2LPENSETR_USBOLPEN_Pos)         /*!< 0x00000100 */
#define RCC_MP_AHB2LPENSETR_USBOLPEN              RCC_MP_AHB2LPENSETR_USBOLPEN_Msk                   /*!< USBO peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB2LPENSETR_SDMMC3LPEN_Pos        (16U)
#define RCC_MP_AHB2LPENSETR_SDMMC3LPEN_Msk        (0x1U << RCC_MP_AHB2LPENSETR_SDMMC3LPEN_Pos)       /*!< 0x00010000 */
#define RCC_MP_AHB2LPENSETR_SDMMC3LPEN            RCC_MP_AHB2LPENSETR_SDMMC3LPEN_Msk                 /*!< SDMMC3 and SDMMC3 delay (DLYBSD3) block peripheral clocks enable during CSleep mode */

/*************  Bit definition for RCC_MP_AHB2LPENCLRR register  **************/
#define RCC_MP_AHB2LPENCLRR_DMA1LPEN_Pos          (0U)
#define RCC_MP_AHB2LPENCLRR_DMA1LPEN_Msk          (0x1U << RCC_MP_AHB2LPENCLRR_DMA1LPEN_Pos)         /*!< 0x00000001 */
#define RCC_MP_AHB2LPENCLRR_DMA1LPEN              RCC_MP_AHB2LPENCLRR_DMA1LPEN_Msk                   /*!< DMA1 peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB2LPENCLRR_DMA2LPEN_Pos          (1U)
#define RCC_MP_AHB2LPENCLRR_DMA2LPEN_Msk          (0x1U << RCC_MP_AHB2LPENCLRR_DMA2LPEN_Pos)         /*!< 0x00000002 */
#define RCC_MP_AHB2LPENCLRR_DMA2LPEN              RCC_MP_AHB2LPENCLRR_DMA2LPEN_Msk                   /*!< DMA2 peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB2LPENCLRR_DMAMUXLPEN_Pos        (2U)
#define RCC_MP_AHB2LPENCLRR_DMAMUXLPEN_Msk        (0x1U << RCC_MP_AHB2LPENCLRR_DMAMUXLPEN_Pos)       /*!< 0x00000004 */
#define RCC_MP_AHB2LPENCLRR_DMAMUXLPEN            RCC_MP_AHB2LPENCLRR_DMAMUXLPEN_Msk                 /*!< DMAMUX peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB2LPENCLRR_ADC12LPEN_Pos         (5U)
#define RCC_MP_AHB2LPENCLRR_ADC12LPEN_Msk         (0x1U << RCC_MP_AHB2LPENCLRR_ADC12LPEN_Pos)        /*!< 0x00000020 */
#define RCC_MP_AHB2LPENCLRR_ADC12LPEN             RCC_MP_AHB2LPENCLRR_ADC12LPEN_Msk                  /*!< ADC1&amp;2 peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB2LPENCLRR_USBOLPEN_Pos          (8U)
#define RCC_MP_AHB2LPENCLRR_USBOLPEN_Msk          (0x1U << RCC_MP_AHB2LPENCLRR_USBOLPEN_Pos)         /*!< 0x00000100 */
#define RCC_MP_AHB2LPENCLRR_USBOLPEN              RCC_MP_AHB2LPENCLRR_USBOLPEN_Msk                   /*!< USBO peripheral clocks enable during CSleep mode */
#define RCC_MP_AHB2LPENCLRR_SDMMC3LPEN_Pos        (16U)
#define RCC_MP_AHB2LPENCLRR_SDMMC3LPEN_Msk        (0x1U << RCC_MP_AHB2LPENCLRR_SDMMC3LPEN_Pos)       /*!< 0x00010000 */
#define RCC_MP_AHB2LPENCLRR_SDMMC3LPEN            RCC_MP_AHB2LPENCLRR_SDMMC3LPEN_Msk                 /*!< SDMMC3 and SDMMC3 delay (DLYBSD3) block peripheral clocks enable during CSleep mode */

